Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །ཉི་ཤུ་རྩ་གཉིས་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །འཕང་དུ་དཔག་ཚད་གཅིག་པ་གདུགས་ཀྱིས་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa “One league tall and adorned with parasols.

source: སངས་རྒྱས་རབ་ཏུ་ཞི་བའི་སྟབས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཛེས་པར་མཆོད་ཅེས་བྱ། །
en: The buddha Praśāntagati Will be born in a place called Beautifully Worshiped.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་དཔག་ཚད། །སུམ་ཅུ་གཉིས་ཡོད་ཡབ་ནི་ཚངས་བཟངས་ཡིན། །མཁས་བློ་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: The family of this victor will be kṣatriya, “And his light will extend thirty-two leagues. Excellent Brahmā will be his father and Mind of Expertise his mother.

source: སྲས་པོ་སྐར་མཁན་སྐར་བཟངས་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Auspicious Star his attendant.

source: སྐྱེས་པ་བུད་མེད་དགའ་བ་མཁས་པ་སྟེ། །
en: Delighting Men and Women will be the scholar

source: འཇིག་རྟེན་དད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Faithful World the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །འཇིག་རྟེན་དག་གི་མཐར་ནི་ཕྱིན་པ་པོ། །དགྲ་བཅོམ་དགེ་འདུན་བྱེ་བ་བཅུ་བཅུ་ཡོད། །
en: There will be sixty-six consecutive congregations, Each gathering one hundred million worthy monks Who have gone beyond the world.

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །ཉི་ཤུ་རྩ་གཉིས་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this teacher Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་དག་གི་གྲངས་ཀྱང་བྱེ་བ་འབྱུང་། །
en: The relics of this victor will be abundant, “And there will be ten million stūpas.

source: བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་འབྱུང་ཞེས་བྱ། །
en: The well-gone Lokasundara Will be born in a place called Happy Event.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་སྨན་པ་བཟང་། །མང་པོས་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend three leagues. Excellent Doctor will be his father, and Venerated by Many will be this victor’s mother.

source: སྲས་པོ་ཟླ་ཉི་རྩི་སྨན་རིམ་གྲོ་པ། །
en: Moon and Sun will be his son and Medicine his attendant.

source: ཡེ་ཤེས་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Wisdom will be the scholar

source: གཏི་མུག་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: “And Abiding Free from Dullness the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་གཉིས་ཏེ། །རེ་རེ་ཀུན་ལའང་དགྲ་དག་བཅོམ་པའི་ཚོགས། །ཐེར་འབུམ་ཕྲག་ནི་ལྔ་ལྔ་འབྱུང་བར་འགྱུར། །
en: There will be thirty-two consecutive congregations, Each of them gathering Five billion worthy ones.

source: འགྲོ་བའི་དོན་དུ་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་ལྔའི་བར་དུ་གནས། །
en: And for the benefit of beings the sacred Dharma Will remain for fifteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དགུ་པ་རིན་ཆེན་བཟང་པོས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa “Measuring nine leagues and studded with excellent jewels.

source: མི་ཡི་མཆོག་མ་མྱ་ངན་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་འཚང་ཞེས་བྱ། །
en: The supreme human, Aśoka, Will be born in a place called Suppression of Suffering.

source: དཔག་ཚད་བཅུ་གཅིག་ཡབ་ནི་མྱ་ངན་མེད། །མྱ་ངན་སྤོང་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “And his light will extend eleven leagues. Free from Suffering will be his father, and Suffering Relinquished will be this victor’s mother.

source: སྲས་པོ་མཛེས་ཅན་སྡུག་ལེགས་རིམ་གྲོ་པ། །
en: Gorgeous will be his son and Fine Beauty his attendant.

source: རབ་ཏུ་བརྒྱན་པ་ཤེས་བློ་ཅན་ཡིན་ཏེ། །
en: Highly Adorned will be the one of knowledge

source: རྣམ་པར་འཕྲུལ་པའི་སེམས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Miraculous Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །འདུས་པ་ཀུན་ལའང་ཡིད་ནི་རབ་ཞི་བ། །བྱེ་བ་ཕྲག་ནི་བཞི་བཅུ་བཞི་བཅུ་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering four hundred million Whose minds are serene.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And for the benefit of beings the sacred Dharma Will remain for seventy thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་ཏེ། །མུ་ཏིག་རྒྱལ་མཚན་རིན་ཆེན་མཆོག་གིས་སྤྲས། །
en: There will be two billion stūpas “Adorned with pearls, banners, and supreme jewels.

source: དེ་བཞིན་གཤེགས་པ་ཤུགས་བཅུ་པ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཐོང་ན་མཆོད་ཅེས་བྱ། །
en: The thus-gone Daśavaśa Will be born in a place called Venerated When Seen.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་གཉིས་ཡོད་ཡབ་ནི་སྟོབས་དབང་ཡིན། །ང་རོ་སྙན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend thirty-two leagues. Powerful Lord will be his father, and Delightful Roar will be this victor’s mother.

source: སྲས་པོ་སྐད་སྙན་བཟང་པོ་རིམ་གྲོ་པ། །
en: Delightful Voice will be his son and Excellent his attendant.

source: དབྱངས་སྙན་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Beautiful Melody will be the scholar

source: སེང་གེའི་གླལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Lion Stance the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རི་ཡི་རྒྱལ་པོ་ལྟ་བུར་མི་གཡོ་བ། །བྱེ་བ་ཕྲག་ནི་འབུམ་ཕྲག་རེ་རེ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering one trillion Who are immutable like Sumeru.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be twenty-two thousand years,

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཅུ་དྲུག་དག་གི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this victor Will remain for sixteen thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དཔག་ཚད་བཅུ་པའི་མཆོད་རྟེན་གདུང་བཅས་གཅིག །
en: When this knower of the world has attained nirvāṇa, “His relics will remain in a single stūpa ten leagues tall.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ལ་དགྱེས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་དབྱངས་ཞེས་བྱ། །
en: The thus-gone Balanandin Will be born in a place called Melody of Joy.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ལེགས་བྱིན་ཡིན། །དགའ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend nine leagues. Gift of Excellence will be his father, and Supreme Joy will be this victor’s mother.

source: སྲས་པོ་དགའ་བ་ཀླུ་ཆེན་རིམ་གྲོ་པ། །
en: Joy will be his son and Great Nāga his attendant.

source: འཇིག་རྟེན་གསུམ་དུ་སྣང་བ་མཁས་པ་སྟེ། །
en: Illuminator of the Three Worlds will be the scholar

source: འཇིགས་པ་མེད་པའི་མཆོག་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Supreme Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །རྩྭ་ཤིང་ལྟ་བུར་ཆགས་པ་མེད་པ་པོ། །ངར་མི་འཛིན་པ་ཉིས་འབུམ་ཉིས་འབུམ་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering two hundred thousand Who are free from grasping an ‘I’ and detached, as if they were grass.

source: དམ་ཆོས་དག་ནི་ལོ་གྲངས་སྟོང་དུ་གནས། །
en: And the sacred Dharma will remain for one thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་བདུན་ཁྲི་བཞི་སྟོང་ཀུན། །ལྷ་ཡི་ལྷ་རྫས་གཞལ་མེད་ཁང་ལྟ་བུར། །གསེར་གྱི་རྒྱལ་མཚན་དག་གིས་རྣམ་པར་སྤྲས། །
en: There will be seventy-four thousand stūpas, Resembling heavenly palaces of divine substance “And adorned with golden banners.

source: བདེ་བར་གཤེགས་པ་མཐུ་དཔལ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ལེགས་པར་བརྟན་པོ་སྦེད་ཅེས་བྱ། །
en: The well-gone Sthāmaśrī Will be born in a place called Hidden Excellent Stability.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །པད་མ་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend one hundred leagues. Fine and Noble Mind will be his father, and Lotus Possessor will be this victor’s mother.

source: སྲས་པོ་ལྷ་དབང་ཚོགས་དབང་རིམ་གྲོ་པ། །
en: Divine King will be his son and Lord of the Gathering his attendant.

source: བློ་སྦྱོང་བ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Trained Mind will be the scholar

source: འཁྲུག་པ་མེད་པའི་བློ་ལྡན་རྫུ་འཕྲུལ་ཅན། །
en: “And Unperturbed Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱ་རྩ་བཅུ་དྲུག་སྟེ། །ཀུན་ལའང་བར་སྣང་མི་གནས་འདྲ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: There will be one hundred sixteen consecutive congregations, Each of them gathering two hundred thirty million Whose minds are nonabiding, like open space.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་སྟོང་ཡང་ཡིན། །
en: “The lifespan of humans will be one thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And for the benefit of beings the sacred Dharma Will remain for sixty-six thousand years.

source: ཞི་བར་ཕྱིན་པའི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་མཆོད་རྟེན་བྱེ་བ་ཕྲག་གཉིས་འབྱུང་། །
en: The relics of the one gone to peace will be abundant, “Contained in twenty million precious stūpas.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཐོབ་པ་དེ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལེགས་གནས་མཆོག་ཅེས་བྱ། །
en: The thus-gone Sthāmaprāpta Will be born in a place called Supreme Abiding.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་རྣམ་པར་རོལ་པ་ཡབ། །ངེས་པར་བྱས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend three leagues. Reveling will be his father, and Ascertained will be this victor’s mother.

source: སྲས་པོ་མ་སྨད་དུལ་བ་རིམ་གྲོ་པ། །
en: Irreproachable will be his son and Trained his attendant.

source: བསོད་ནམས་ཕུང་པོའི་གཟི་བརྗིད་རྫུ་འཕྲུལ་ཅན། །
en: “And Splendid Heap of Merit the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྨས་པ་མེད་ཅིང་རིམས་ནད་མེད་པ་པོ། །དགྲ་བཅོམ་ཐེར་འབུམ་ཕྲག་ནི་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering three billion worthy ones Free from all wounds and contagions.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་ཡིན། །དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་གཉིས་བར་དུ་གནས་པར་འགྱུར། །
en: “The lifespan of humans will be seventy-four thousand years, And the sacred Dharma will remain For ninety-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་བཅས་པའི་མཆོད་རྟེན་གྲངས། །བདུན་ཡོད་དཔག་ཚད་གཅིག་པ་གསེར་གྱིས་སྤྲས། །
en: The relics of this victor will reside in seven stūpas, “One league large and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ནི་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་བར་དཀའ་ཞེས་བྱ། །
en: The thus-gone Mahāsthāman Will be born in a place called Hard to Conquer.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་གསུམ་ཡོད་གཞལ་མེད་ཁང་པ་ཡབ། །ཡིད་དགའ་ཡུམ་ཡིན་ཁ་ལོ་སྒྱུར་བ་ནི། །སྲས་པོ་ཤིན་ཏུ་བདེན་པ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, “And his light will extend thirty-three leagues. Palace will be his father and Joyous Mind his mother. Leader will be his son and Utterly True his attendant.

source: འགྲོ་སྡུག་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Attractive Movement will be the scholar

source: ཆགས་པ་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: “And Remaining Detached the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བཞི་བཅུ་སྟེ། །ཀུན་ལའང་སེམས་ནི་ཟླ་བ་ཉ་འདྲ་བ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཁྲི་ཉི་ཁྲི་ཡོད། །
en: There will be forty consecutive congregations, Each of them gathering two hundred billion Whose minds are all like full moons.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be thirty-two thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བཞིའི་བར་དུ་གནས། །
en: And for the benefit of beings the sacred Dharma will remain For fourteen thousand years.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་བཅུ་འབྱུང་། །
en: After this incomparable one has attained nirvāṇa “There will appear ten billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་སྙིང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་རྟེན་མཆོད་ཅེས་བྱ། །
en: The thus-gone Guṇagarbha Will be born in a place called Venerated Stūpa.

source: དཔག་ཚད་གཅིག་ཡོད་བདག་ཉིད་ཆེན་པོ་ཡབ། །འགྲོས་མཆོད་རྒྱལ་ཡུམ་སྲས་པོ་རྫུ་འཕྲུལ་ཅན། །ཤིན་ཏུ་འབྱོར་ཞེས་བྱ་བ་རིམ་གྲོ་པ། །
en: “And his light will extend one league. Great Being will be his father, and Worship Mode will be this victor’s mother. Possessor of Miraculous Power will be his son and Tremendous Wealth his attendant.

source: ཆུ་ལྷ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Joyous Water God will be the scholar

source: ཚངས་པ་ལྷ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Brahmā Deity the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །དྲི་གསུམ་དྲི་བྲལ་ཆགས་པ་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་འབྱུང་བར་འགྱུར། །
en: There will be ten consecutive congregations, Each of them gathering one billion Who are free from the dirt of the three stains and have attained detachment.

source: རྒྱལ་བའི་སྐུ་ཚེ་ལོ་གྲངས་ཁྲི་ཆིག་སྟོང་། །འཇིག་རྟེན་གསུམ་ལ་ཕན་ཕྱིར་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “The lifespan of this victorious one will be eleven thousand years, And for the benefit of the three worlds His sacred Dharma will remain for twenty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་བཅས་པའི་མཆོད་རྟེན་གཅིག །དཔག་ཚད་བཞི་པ་གདུགས་གྲངས་སྟོང་དང་ལྡན། །
en: There will be a single stūpa of this victor’s relics, “Four leagues large and adorned with a thousand parasols.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པར་སྤྱོད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདེན་པ་འདོད་ཅེས་བྱ། །
en: The thus-gone Satyacara Will be born in a place called Truth Wish.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་སྟོབས་ལྡན་ཞི། །འོད་མཛེས་པ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend six leagues. Powerful Peace will be his father, and Beautiful Light will be this victor’s mother.

source: སྲས་པོ་མཆོག་ལྡན་དོན་བཟངས་རིམ་གྲོ་པ། །
en: Possessor of the Supreme will be his son and Excellent Meaning his attendant.

source: ཡོན་ཏན་མཐུ་རྩལ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Powerful Qualities will be the scholar

source: མཐུ་རྩལ་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Supreme Power the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ཉོན་མོངས་དྲི་མ་ཀུན་སྤངས་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering two hundred thirty million Who have all entirely relinquished the stains of defilement.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་དགུ་ཁྲི་ཡིན། །
en: “The lifespan of humans will be ninety thousand years,

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one gone to peace Will remain for ninety-nine thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དགུ་བཅུ་རྩ་བཞི་སྟེ། །རིན་ཆེན་རྟ་བབས་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: There will be ninety-four thousand stūpas of this victor, “Adorned with jewel arches and gold.

source: དེ་བཞིན་གཤེགས་པ་དགེ་མཆོག་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མི་འཇིགས་བརྫི་བ་མེད། །
en: The thus-gone Kṣemottamarāja Will be born in a place called Indomitable Fearlessness.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་གླང་པོའི་དབང་པོ་ཡབ། །སེམས་མཚུངས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend one hundred leagues. Elephant King will be his father, and Equal Mind will be this victor’s mother.

source: སྲས་པོ་སྲིད་དགའ་མཆོད་པ་རིམ་གྲོ་པ། །
en: Joy in Existence will be his son and Worship his attendant.

source: སྤོབས་པའི་ང་རོ་ཞེས་བྱ་བློ་ལྡན་ཏེ། །
en: Roaring Acumen will be the scholar

source: གྲགས་པ་ཀུན་འཕགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Superior Fame the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་དྲང་སྲོང་བདུད་ཡུལ་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering two hundred twenty million sages Who are free from the realm of the māras.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་སྟོང་ཚང་བར་གནས་པར་འགྱུར། །
en: And the sacred Dharma of the one gone to peace Will remain complete for three thousand years.

source: དཔག་ཚད་གཉིས་པའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག ། གསེར་གྱི་རྒྱལ་མཚན་གདུགས་ཀྱིས་རྣམ་པར་སྤྲས། །
en: There will be a single stūpa of two leagues, “Adorned with golden banners and parasols.

source: བདེ་གཤེགས་ཡོན་ཏན་རྒྱ་མཚོ་སྐར་རྒྱལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་མཚན་གྱིས་སྤྲས་ཞེས་བྱ། །
en: The well-gone Tiṣya, the ocean of qualities, Will be born in a place called Studded with Signs.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་བློ་ལྡན་ཡིན། །ཡིད་དགའ་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend nine leagues. Intelligent will be his father, and Joyous Mind will be this victor’s mother.

source: སྲས་པོ་ཁྲོས་ཅན་རྡུལ་བྲལ་རིམ་གྲོ་པ། །
en: Wrathful will be his son and Immaculate his attendant.

source: ཡིད་གཉིས་སྤོང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Abandoning Doubt will be the scholar

source: ཐེ་ཚོམ་འཇོམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Crusher of Doubts the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་གཉིས་ཏེ། །ཀུན་ལའང་དངོས་པོ་བསལ་བར་གྱུར་པ་པོ། །འཆིང་བ་བཅད་པ་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: There will be sixty-two consecutive congregations, Each of them gathering one billion Who have dispelled all entities and cut through the bonds.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །སུམ་ཅུ་རྩ་གཉིས་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For thirty-two thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་དགུ་ཁྲི་དགུ་སྟོང་སྟེ། །ལྷ་ཡི་གཞལ་མེད་ཁང་ལྟར་ཤིན་ཏུ་སྤྲས། །
en: There will be ninety-nine thousand stūpas, “Richly adorned, like divine palaces.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྣང་ཞེས་བྱ། །
en: The thus-gone Mahāraśmi Will be born in a place called Light of Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །ཏོག་གི་བློ་གྲོས་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend ten leagues. Crest of Excellence will be his father, and Crest of Intelligence will be this victor’s mother.

source: སྲས་པོ་ལྷས་བྱིན་བླ་མ་རིམ་གྲོ་པ། །
en: Gift of the Gods will be his son and Highest his attendant.

source: སྲིད་པའི་རྒྱ་མཚོ་འཁྲུགས་བྱེད་མཁས་པ་སྟེ། །
en: Stirrer of the Ocean of Existence will be the scholar

source: སྨྲ་བའི་ཆུ་མཆོག་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Supreme River of Speech the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་སྟེ་ཀུན་ལ་ཡང་། །སྲིད་པའི་རྒྱ་མཚོ་སྐེམས་པའི་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་དགུ་དགུ་ཡོད། །
en: There will be nine consecutive congregations, Each of them gathering three hundred ninety million Whose minds have dried up the ocean of existence.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one gone to peace will remain For seventy-one thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་ས་གཞི་ཐམས་ཅད་དུ། །མཆོད་རྟེན་གྲངས་ནི་དགུ་ཁྲི་འབྱུང་བར་འགྱུར། །
en: His relics will be abundant. There will be ninety thousand stūpas, covering the entire earth.

source: ཡོན་ཏན་མངའ་བ་གློག་གི་འོད་སྐྱེ་བའི། །ཡུལ་ནི་གཟི་བྱིན་ཤིན་ཏུ་བརྒྱན་ཅེས་བྱ། །
en: The master of qualities Vidyutprabha Will be born in a place called Splendidly Adorned.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་ལག་བཟངས་ཡིན། །ལྷས་བསམས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, “And his light will extend five hundred leagues. Excellent Hand will be his father, and Thought of by Gods will be this victor’s mother.

source: སྲས་པོ་སྒོམ་བྱེད་ངོས་བཟངས་རིམ་གྲོ་པ། །
en: Cultivator will be his son and Fine Face his attendant.

source: གྲགས་མཆོག་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Fame will be the scholar

source: ཁ་ལོ་སྒྱུར་བའི་རྒྱལ་པོ་རྫུ་འཕྲུལ་ཅན། །
en: “And King of Leaders the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །ཚུལ་བཞིན་ཆོས་ལ་འཇིགས་མེད་ཐོབ་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: There will be eleven consecutive congregations, Each of them gathering two hundred million Who have attained authentic fearlessness in accord with the Dharma.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་ཡིན། །
en: “The lifespan of humans will be twenty-three thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་འབུམ་བར་དུ་གནས་པར་འགྱུར། །
en: And for the benefit of beings the sacred Dharma Will remain for nine hundred thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཞི་པ་དག །གསེར་གྱི་མཆོད་རྟེན་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: The stūpas of this victor will be four leagues large, “Surrounded by golden stūpas and banners.

source: བདེ་གཤེགས་མགོན་པོ་ཡོན་ཏན་རྒྱ་ཆེན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་མཚན་མོ་རྒྱས་ཞེས་བྱ། །
en: The well-gone protector Guṇavisṛta Will be born in a place called Blooming Night.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་བློ་བཟང་ཡིན། །བློ་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend six leagues. Excellent Mind will be his father, and Intelligent will be this victor’s mother.

source: སྲས་པོ་རྟོགས་བྱེད་བློ་ལྡན་རིམ་གྲོ་པ། །
en: Realizer will be his son and Intelligent his attendant.

source: བློས་འགྲོ་བ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Intelligent Movement will be the scholar

source: རྣམ་པར་འཕྲུལ་པའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Miraculous Intelligence the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཏེ་ཀུན་ལ་ཡང་། །ལྷུན་པོའི་རྩེ་ལྟར་གཡོ་བ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be seven consecutive congregations, Each of them gathering nine hundred ninety million Who are unshakable like mountain peaks.

source: རྒྱལ་བ་ཐུབ་པ་ཞི་བར་ཕྱིན་པ་ཡི། །དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་དུ་གནས། །
en: And when the able victor has gone to peace His sacred Dharma will remain for one thousand years.

source: མཆོད་རྟེན་ཐེར་འབུམ་ཕྲག་ནི་གཉིས་ཡོད་དེ། །རིན་ཆེན་ཆུན་ཕྲེང་སྟོང་སྙེད་དག་གིས་སྤྲས། །
en: There will be two billion stūpas “Adorned with thousands of jewels.

source: མི་ཡི་འདྲེན་པ་རིན་པོ་ཆེ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་མང་ཞེས་བྱ། །
en: The guide of humanity, Ratna, Will be born in a place called Abundant Jewels.

source: རིགས་ནི་རྒྱལ་རིགས་འོད་ཚད་ཞིང་གི་གྲངས། །སྟོང་སྙེད་ཁྱབ་པ་ཡབ་ནི་རིན་ཆེན་བཟངས། །རིན་ཆེན་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, “And his light will engulf thousands of realms. Excellent Jewel will be his father and Supreme Jewel will be this victor’s mother.

source: སྲས་པོ་དགའ་བྱིན་ཁྱད་འཕགས་རིམ་གྲོ་པ། །
en: Gift of Joy will be his son and Distinguished his attendant.

source: རྣམ་གྲངས་སེམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Revolving Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །སྲིད་པར་འཆིང་བ་གཅོད་པར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་དྲུག་དྲུག་འདུས། །
en: There will be eight consecutive congregations, Each of them gathering two hundred sixty million Who cut through the ties of existence.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་བཞི་སྟོང་ཡིན། །
en: “The lifespan of humans will be sixty-four thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བརྒྱད་ཅུ་རྩ་ལྔའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain for eighty-five thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་དག །རིན་ཆེན་གཙུག་ཕུད་བྱེ་བ་དག་གིས་སྤྲས། །
en: The stūpa of this victorious one will measure three leagues And be adorned with millions of crown jewels.

source: འགྲོ་བ་དག་གིས་མཆོད་པ་དཔལ་འོད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་པད་མ་ཅན་ཞེས་བྱ། །
en: “The recipient of the world’s worship, Śrīprabha, Will be born in a place called Endowed with Lotuses.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་བཀྲ་ཤིས་ཡིན། །ལེགས་མཆོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one league. Auspicious will be his father and Lady of Fine Worship will be this victor’s mother.

source: སྲས་པོ་མགོན་བྱིན་མགོན་བཟངས་རིམ་གྲོ་པ། །
en: Gift of Protection will be his son and Excellent Protection his attendant.

source: སྡུག་དགའ་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Joyous Beauty will be the scholar

source: ཐར་པ་རྣམ་པར་སྒྲོགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Proclaimer of Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཟླ་བ་ཉ་འདྲ་དྲི་མ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred thirty million Who are all stainless and resemble the full moon.
